zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/include/pio/pic32ck1025sg01144.h
#define PIN_PB00H_CAN1_TX                          _UINT32_(32)
#define MUX_PB00H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PB00H_CAN1_TX                       ((PIN_PB00H_CAN1_TX << 16) | MUX_PB00H_CAN1_TX)
#define PORT_PB00H_CAN1_TX                         (_UINT32_(1) << 0)

#define PIN_PB23H_CAN1_TX                          _UINT32_(55)
#define MUX_PB23H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PB23H_CAN1_TX                       ((PIN_PB23H_CAN1_TX << 16) | MUX_PB23H_CAN1_TX)
#define PORT_PB23H_CAN1_TX                         (_UINT32_(1) << 23)

#define PIN_PC06H_CAN1_TX                          _UINT32_(70)
#define MUX_PC06H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PC06H_CAN1_TX                       ((PIN_PC06H_CAN1_TX << 16) | MUX_PC06H_CAN1_TX)
#define PORT_PC06H_CAN1_TX                         (_UINT32_(1) << 6)

#define PIN_PD20H_CAN1_TX                          _UINT32_(116)
#define MUX_PD20H_CAN1_TX                          _UINT32_(7) 
#define PINMUX_PD20H_CAN1_TX                       ((PIN_PD20H_CAN1_TX << 16) | MUX_PD20H_CAN1_TX)
#define PORT_PD20H_CAN1_TX                         (_UINT32_(1) << 20)

/* =================== PORT definition for CCL peripheral =================== */
#define PIN_PB07M_CCL_IN0                          _UINT32_(39)
#define MUX_PB07M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB07M_CCL_IN0                       ((PIN_PB07M_CCL_IN0 << 16) | MUX_PB07M_CCL_IN0)
#define PORT_PB07M_CCL_IN0                         (_UINT32_(1) << 7)

#define PIN_PB22M_CCL_IN0                          _UINT32_(54)
#define MUX_PB22M_CCL_IN0                          _UINT32_(12)
#define PINMUX_PB22M_CCL_IN0                       ((PIN_PB22M_CCL_IN0 << 16) | MUX_PB22M_CCL_IN0)
#define PORT_PB22M_CCL_IN0                         (_UINT32_(1) << 22)

#define PIN_PB08M_CCL_IN1                          _UINT32_(40)
#define MUX_PB08M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB08M_CCL_IN1                       ((PIN_PB08M_CCL_IN1 << 16) | MUX_PB08M_CCL_IN1)
#define PORT_PB08M_CCL_IN1                         (_UINT32_(1) << 8)

#define PIN_PB23M_CCL_IN1                          _UINT32_(55)
#define MUX_PB23M_CCL_IN1                          _UINT32_(12)
#define PINMUX_PB23M_CCL_IN1                       ((PIN_PB23M_CCL_IN1 << 16) | MUX_PB23M_CCL_IN1)
#define PORT_PB23M_CCL_IN1                         (_UINT32_(1) << 23)

#define PIN_PB09M_CCL_IN2                          _UINT32_(41)
#define MUX_PB09M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PB09M_CCL_IN2                       ((PIN_PB09M_CCL_IN2 << 16) | MUX_PB09M_CCL_IN2)
#define PORT_PB09M_CCL_IN2                         (_UINT32_(1) << 9)

#define PIN_PB24M_CCL_IN2                          _UINT32_(56)
#define MUX_PB24M_CCL_IN2                          _UINT32_(12)
#define PINMUX_PB24M_CCL_IN2                       ((PIN_PB24M_CCL_IN2 << 16) | MUX_PB24M_CCL_IN2)
#define PORT_PB24M_CCL_IN2                         (_UINT32_(1) << 24)

#define PIN_PC10M_CCL_IN3                          _UINT32_(74)
#define MUX_PC10M_CCL_IN3                          _UINT32_(12)
#define PINMUX_PC10M_CCL_IN3                       ((PIN_PC10M_CCL_IN3 << 16) | MUX_PC10M_CCL_IN3)
#define PORT_PC10M_CCL_IN3                         (_UINT32_(1) << 10)

#define PIN_PC24M_CCL_IN3                          _UINT32_(88)
#define MUX_PC24M_CCL_IN3                          _UINT32_(12)
#define PINMUX_PC24M_CCL_IN3                       ((PIN_PC24M_CCL_IN3 << 16) | MUX_PC24M_CCL_IN3)
#define PORT_PC24M_CCL_IN3                         (_UINT32_(1) << 24)

#define PIN_PC11M_CCL_IN4                          _UINT32_(75)
#define MUX_PC11M_CCL_IN4                          _UINT32_(12)
#define PINMUX_PC11M_CCL_IN4                       ((PIN_PC11M_CCL_IN4 << 16) | MUX_PC11M_CCL_IN4)
#define PORT_PC11M_CCL_IN4                         (_UINT32_(1) << 11)

#define PIN_PC25M_CCL_IN4                          _UINT32_(89)
#define MUX_PC25M_CCL_IN4                          _UINT32_(12)
#define PINMUX_PC25M_CCL_IN4                       ((PIN_PC25M_CCL_IN4 << 16) | MUX_PC25M_CCL_IN4)
#define PORT_PC25M_CCL_IN4                         (_UINT32_(1) << 25)

#define PIN_PC12M_CCL_IN5                          _UINT32_(76)
#define MUX_PC12M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC12M_CCL_IN5                       ((PIN_PC12M_CCL_IN5 << 16) | MUX_PC12M_CCL_IN5)
#define PORT_PC12M_CCL_IN5                         (_UINT32_(1) << 12)

#define PIN_PC26M_CCL_IN5                          _UINT32_(90)
#define MUX_PC26M_CCL_IN5                          _UINT32_(12)
#define PINMUX_PC26M_CCL_IN5                       ((PIN_PC26M_CCL_IN5 << 16) | MUX_PC26M_CCL_IN5)
#define PORT_PC26M_CCL_IN5                         (_UINT32_(1) << 26)

#define PIN_PD08M_CCL_IN6                          _UINT32_(104)
#define MUX_PD08M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PD08M_CCL_IN6                       ((PIN_PD08M_CCL_IN6 << 16) | MUX_PD08M_CCL_IN6)
#define PORT_PD08M_CCL_IN6                         (_UINT32_(1) << 8)

#define PIN_PD17M_CCL_IN6                          _UINT32_(113)
#define MUX_PD17M_CCL_IN6                          _UINT32_(12)
#define PINMUX_PD17M_CCL_IN6                       ((PIN_PD17M_CCL_IN6 << 16) | MUX_PD17M_CCL_IN6)
#define PORT_PD17M_CCL_IN6                         (_UINT32_(1) << 17)

#define PIN_PD09M_CCL_IN7                          _UINT32_(105)
#define MUX_PD09M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PD09M_CCL_IN7                       ((PIN_PD09M_CCL_IN7 << 16) | MUX_PD09M_CCL_IN7)
#define PORT_PD09M_CCL_IN7                         (_UINT32_(1) << 9)

#define PIN_PD18M_CCL_IN7                          _UINT32_(114)
#define MUX_PD18M_CCL_IN7                          _UINT32_(12)
#define PINMUX_PD18M_CCL_IN7                       ((PIN_PD18M_CCL_IN7 << 16) | MUX_PD18M_CCL_IN7)
#define PORT_PD18M_CCL_IN7                         (_UINT32_(1) << 18)

#define PIN_PD10M_CCL_IN8                          _UINT32_(106)
#define MUX_PD10M_CCL_IN8                          _UINT32_(12)
#define PINMUX_PD10M_CCL_IN8                       ((PIN_PD10M_CCL_IN8 << 16) | MUX_PD10M_CCL_IN8)
#define PORT_PD10M_CCL_IN8                         (_UINT32_(1) << 10)

#define PIN_PD19M_CCL_IN8                          _UINT32_(115)
#define MUX_PD19M_CCL_IN8                          _UINT32_(12)
#define PINMUX_PD19M_CCL_IN8                       ((PIN_PD19M_CCL_IN8 << 16) | MUX_PD19M_CCL_IN8)
#define PORT_PD19M_CCL_IN8                         (_UINT32_(1) << 19)

