zephyrproject-rtos/hal_microchip/packs/pic32c/pic32ck_sg_gc/pic32ck_sg01/include/pio/pic32ck1025sg01144.h
#define PIN_PA20M_GCLK_IO2                         _UINT32_(20)
#define MUX_PA20M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PA20M_GCLK_IO2                      ((PIN_PA20M_GCLK_IO2 << 16) | MUX_PA20M_GCLK_IO2)
#define PORT_PA20M_GCLK_IO2                        (_UINT32_(1) << 20)

#define PIN_PC00M_GCLK_IO2                         _UINT32_(64)
#define MUX_PC00M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PC00M_GCLK_IO2                      ((PIN_PC00M_GCLK_IO2 << 16) | MUX_PC00M_GCLK_IO2)
#define PORT_PC00M_GCLK_IO2                        (_UINT32_(1) << 0)

#define PIN_PD12M_GCLK_IO2                         _UINT32_(108)
#define MUX_PD12M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PD12M_GCLK_IO2                      ((PIN_PD12M_GCLK_IO2 << 16) | MUX_PD12M_GCLK_IO2)
#define PORT_PD12M_GCLK_IO2                        (_UINT32_(1) << 12)

#define PIN_PA21M_GCLK_IO3                         _UINT32_(21)
#define MUX_PA21M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PA21M_GCLK_IO3                      ((PIN_PA21M_GCLK_IO3 << 16) | MUX_PA21M_GCLK_IO3)
#define PORT_PA21M_GCLK_IO3                        (_UINT32_(1) << 21)

#define PIN_PC01M_GCLK_IO3                         _UINT32_(65)
#define MUX_PC01M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PC01M_GCLK_IO3                      ((PIN_PC01M_GCLK_IO3 << 16) | MUX_PC01M_GCLK_IO3)
#define PORT_PC01M_GCLK_IO3                        (_UINT32_(1) << 1)

#define PIN_PD05M_GCLK_IO3                         _UINT32_(101)
#define MUX_PD05M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PD05M_GCLK_IO3                      ((PIN_PD05M_GCLK_IO3 << 16) | MUX_PD05M_GCLK_IO3)
#define PORT_PD05M_GCLK_IO3                        (_UINT32_(1) << 5)

#define PIN_PA22M_GCLK_IO4                         _UINT32_(22)
#define MUX_PA22M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PA22M_GCLK_IO4                      ((PIN_PA22M_GCLK_IO4 << 16) | MUX_PA22M_GCLK_IO4)
#define PORT_PA22M_GCLK_IO4                        (_UINT32_(1) << 22)

#define PIN_PC02M_GCLK_IO4                         _UINT32_(66)
#define MUX_PC02M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PC02M_GCLK_IO4                      ((PIN_PC02M_GCLK_IO4 << 16) | MUX_PC02M_GCLK_IO4)
#define PORT_PC02M_GCLK_IO4                        (_UINT32_(1) << 2)

#define PIN_PD06M_GCLK_IO4                         _UINT32_(102)
#define MUX_PD06M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PD06M_GCLK_IO4                      ((PIN_PD06M_GCLK_IO4 << 16) | MUX_PD06M_GCLK_IO4)
#define PORT_PD06M_GCLK_IO4                        (_UINT32_(1) << 6)

#define PIN_PA23M_GCLK_IO5                         _UINT32_(23)
#define MUX_PA23M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PA23M_GCLK_IO5                      ((PIN_PA23M_GCLK_IO5 << 16) | MUX_PA23M_GCLK_IO5)
#define PORT_PA23M_GCLK_IO5                        (_UINT32_(1) << 23)

#define PIN_PC03M_GCLK_IO5                         _UINT32_(67)
#define MUX_PC03M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PC03M_GCLK_IO5                      ((PIN_PC03M_GCLK_IO5 << 16) | MUX_PC03M_GCLK_IO5)
#define PORT_PC03M_GCLK_IO5                        (_UINT32_(1) << 3)

#define PIN_PD07M_GCLK_IO5                         _UINT32_(103)
#define MUX_PD07M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PD07M_GCLK_IO5                      ((PIN_PD07M_GCLK_IO5 << 16) | MUX_PD07M_GCLK_IO5)
#define PORT_PD07M_GCLK_IO5                        (_UINT32_(1) << 7)

#define PIN_PA17M_GCLK_IO6                         _UINT32_(17)
#define MUX_PA17M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PA17M_GCLK_IO6                      ((PIN_PA17M_GCLK_IO6 << 16) | MUX_PA17M_GCLK_IO6)
#define PORT_PA17M_GCLK_IO6                        (_UINT32_(1) << 17)

#define PIN_PC04M_GCLK_IO6                         _UINT32_(68)
#define MUX_PC04M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PC04M_GCLK_IO6                      ((PIN_PC04M_GCLK_IO6 << 16) | MUX_PC04M_GCLK_IO6)
#define PORT_PC04M_GCLK_IO6                        (_UINT32_(1) << 4)

#define PIN_PA24M_GCLK_IO7                         _UINT32_(24)
#define MUX_PA24M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PA24M_GCLK_IO7                      ((PIN_PA24M_GCLK_IO7 << 16) | MUX_PA24M_GCLK_IO7)
#define PORT_PA24M_GCLK_IO7                        (_UINT32_(1) << 24)

#define PIN_PC05M_GCLK_IO7                         _UINT32_(69)
#define MUX_PC05M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PC05M_GCLK_IO7                      ((PIN_PC05M_GCLK_IO7 << 16) | MUX_PC05M_GCLK_IO7)
#define PORT_PC05M_GCLK_IO7                        (_UINT32_(1) << 5)

/* =================== PORT definition for PCC peripheral =================== */
#define PIN_PA20K_PCC_CLK                          _UINT32_(20)
#define MUX_PA20K_PCC_CLK                          _UINT32_(10)
#define PINMUX_PA20K_PCC_CLK                       ((PIN_PA20K_PCC_CLK << 16) | MUX_PA20K_PCC_CLK)
#define PORT_PA20K_PCC_CLK                         (_UINT32_(1) << 20)

#define PIN_PC05K_PCC_CLK                          _UINT32_(69)
#define MUX_PC05K_PCC_CLK                          _UINT32_(10)
#define PINMUX_PC05K_PCC_CLK                       ((PIN_PC05K_PCC_CLK << 16) | MUX_PC05K_PCC_CLK)
#define PORT_PC05K_PCC_CLK                         (_UINT32_(1) << 5)

#define PIN_PA21K_PCC_DATA0                        _UINT32_(21)
#define MUX_PA21K_PCC_DATA0                        _UINT32_(10)
#define PINMUX_PA21K_PCC_DATA0                     ((PIN_PA21K_PCC_DATA0 << 16) | MUX_PA21K_PCC_DATA0)
#define PORT_PA21K_PCC_DATA0                       (_UINT32_(1) << 21)

#define PIN_PC01K_PCC_DATA0                        _UINT32_(65)
#define MUX_PC01K_PCC_DATA0                        _UINT32_(10)
#define PINMUX_PC01K_PCC_DATA0                     ((PIN_PC01K_PCC_DATA0 << 16) | MUX_PC01K_PCC_DATA0)
#define PORT_PC01K_PCC_DATA0                       (_UINT32_(1) << 1)

